tools/fio_rw_2025-12-16_193843.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1445768: Tue Dec 16 19:38:45 2025
  read: IOPS=84.5k, BW=330MiB/s (346MB/s)(512MiB/1551msec)
    slat (nsec): min=665, max=56310, avg=2645.82, stdev=2787.38
    clat (nsec): min=271, max=4059.3k, avg=106389.41, stdev=104222.62
     lat (nsec): min=969, max=4061.0k, avg=109035.23, stdev=104577.46
    clat percentiles (nsec):
     |  1.00th=[   1848],  5.00th=[  13248], 10.00th=[  22400],
     | 20.00th=[  34560], 30.00th=[  48896], 40.00th=[  73216],
     | 50.00th=[  93696], 60.00th=[ 108032], 70.00th=[ 124416],
     | 80.00th=[ 156672], 90.00th=[ 228352], 95.00th=[ 268288],
     | 99.00th=[ 329728], 99.50th=[ 358400], 99.90th=[ 415744],
     | 99.95th=[2007040], 99.99th=[3129344]
   bw (  KiB/s): min=305272, max=357008, per=99.91%, avg=337632.00, stdev=28206.23, samples=3
   iops        : min=76318, max=89252, avg=84408.00, stdev=7051.56, samples=3
  write: IOPS=84.5k, BW=330MiB/s (346MB/s)(512MiB/1551msec); 0 zone resets
    slat (nsec): min=1365, max=230341, avg=5868.95, stdev=5179.70
    clat (usec): min=12, max=4060, avg=64.88, stdev=49.39
     lat (usec): min=18, max=4063, avg=70.75, stdev=49.84
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   36], 10.00th=[   41], 20.00th=[   47],
     | 30.00th=[   53], 40.00th=[   58], 50.00th=[   63], 60.00th=[   69],
     | 70.00th=[   74], 80.00th=[   80], 90.00th=[   90], 95.00th=[   99],
     | 99.00th=[  122], 99.50th=[  135], 99.90th=[  165], 99.95th=[  221],
     | 99.99th=[ 2802]
   bw (  KiB/s): min=305128, max=354504, per=99.86%, avg=337634.67, stdev=28158.34, samples=3
   iops        : min=76282, max=88626, avg=84408.67, stdev=7039.58, samples=3
  lat (nsec)   : 500=0.42%, 750=0.01%
  lat (usec)   : 2=0.09%, 4=0.31%, 10=1.01%, 20=2.38%, 50=23.88%
  lat (usec)   : 100=46.85%, 250=21.32%, 500=3.70%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=0.01%
  cpu          : usr=13.35%, sys=62.58%, ctx=88211, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=330MiB/s (346MB/s), 330MiB/s-330MiB/s (346MB/s-346MB/s), io=512MiB (537MB), run=1551-1551msec
  WRITE: bw=330MiB/s (346MB/s), 330MiB/s-330MiB/s (346MB/s-346MB/s), io=512MiB (537MB), run=1551-1551msec

Disk stats (read/write):
  nvme0n1: ios=71064/117413, sectors=568512/939312, merge=0/0, ticks=8278/2350, in_queue=10629, util=59.88%