tools/fio_rw_2025-12-16_194015.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1446862: Tue Dec 16 19:40:18 2025
  read: IOPS=49.8k, BW=195MiB/s (204MB/s)(512MiB/2631msec)
    slat (nsec): min=669, max=215011, avg=2277.55, stdev=2703.24
    clat (nsec): min=271, max=11314k, avg=280727.15, stdev=749537.87
     lat (nsec): min=998, max=11317k, avg=283004.70, stdev=749981.90
    clat percentiles (nsec):
     |  1.00th=[    294],  5.00th=[    314], 10.00th=[    532],
     | 20.00th=[   5024], 30.00th=[  10432], 40.00th=[  71168],
     | 50.00th=[ 113152], 60.00th=[ 152576], 70.00th=[ 211968],
     | 80.00th=[ 276480], 90.00th=[ 387072], 95.00th=[1138688],
     | 99.00th=[4554752], 99.50th=[5472256], 99.90th=[6979584],
     | 99.95th=[7634944], 99.99th=[9764864]
   bw (  KiB/s): min=43464, max=380976, per=95.98%, avg=191206.40, stdev=173087.01, samples=5
   iops        : min=10866, max=95244, avg=47801.60, stdev=43271.75, samples=5
  write: IOPS=49.8k, BW=195MiB/s (204MB/s)(512MiB/2631msec); 0 zone resets
    slat (nsec): min=1418, max=210677, avg=3049.66, stdev=3095.86
    clat (usec): min=10, max=4201, avg=34.17, stdev=57.06
     lat (usec): min=17, max=4203, avg=37.22, stdev=57.39
    clat percentiles (usec):
     |  1.00th=[   19],  5.00th=[   21], 10.00th=[   23], 20.00th=[   26],
     | 30.00th=[   28], 40.00th=[   30], 50.00th=[   31], 60.00th=[   34],
     | 70.00th=[   36], 80.00th=[   38], 90.00th=[   43], 95.00th=[   48],
     | 99.00th=[   80], 99.50th=[  128], 99.90th=[  355], 99.95th=[  635],
     | 99.99th=[ 3949]
   bw (  KiB/s): min=43712, max=378224, per=95.78%, avg=190918.40, stdev=172783.44, samples=5
   iops        : min=10928, max=94556, avg=47729.60, stdev=43195.86, samples=5
  lat (nsec)   : 500=4.97%, 750=0.04%, 1000=0.01%
  lat (usec)   : 2=0.61%, 4=3.04%, 10=6.08%, 20=5.74%, 50=47.13%
  lat (usec)   : 100=5.70%, 250=14.50%, 500=8.66%, 750=0.57%, 1000=0.29%
  lat (msec)   : 2=1.01%, 4=0.99%, 10=0.66%, 20=0.01%
  cpu          : usr=7.98%, sys=29.01%, ctx=91670, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=195MiB/s (204MB/s), 195MiB/s-195MiB/s (204MB/s-204MB/s), io=512MiB (537MB), run=2631-2631msec
  WRITE: bw=195MiB/s (204MB/s), 195MiB/s-195MiB/s (204MB/s-204MB/s), io=512MiB (537MB), run=2631-2631msec

Disk stats (read/write):
  nvme0n1: ios=66278/109567, sectors=530224/876544, merge=0/0, ticks=33003/2346, in_queue=35349, util=74.90%