tools/fio_rw_2025-12-16_200100.log
rand_rw_test: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.36
Starting 1 process

rand_rw_test: (groupid=0, jobs=1): err= 0: pid=1467985: Tue Dec 16 20:01:03 2025
  read: IOPS=43.8k, BW=171MiB/s (180MB/s)(512MiB/2990msec)
    slat (nsec): min=676, max=211839, avg=2218.25, stdev=1883.83
    clat (nsec): min=277, max=8956.5k, avg=308791.19, stdev=541959.28
     lat (nsec): min=990, max=8959.3k, avg=311009.44, stdev=542169.41
    clat percentiles (nsec):
     |  1.00th=[    298],  5.00th=[    314], 10.00th=[    398],
     | 20.00th=[   3952], 30.00th=[   9536], 40.00th=[  72192],
     | 50.00th=[ 130560], 60.00th=[ 191488], 70.00th=[ 259072],
     | 80.00th=[ 354304], 90.00th=[ 970752], 95.00th=[1613824],
     | 99.00th=[2375680], 99.50th=[2801664], 99.90th=[3948544],
     | 99.95th=[4685824], 99.99th=[7110656]
   bw (  KiB/s): min=78312, max=373752, per=100.00%, avg=195934.40, stdev=124482.72, samples=5
   iops        : min=19578, max=93438, avg=48983.60, stdev=31120.68, samples=5
  write: IOPS=43.8k, BW=171MiB/s (180MB/s)(512MiB/2990msec); 0 zone resets
    slat (nsec): min=1465, max=247177, avg=3000.87, stdev=2138.43
    clat (usec): min=11, max=6700, avg=50.04, stdev=170.00
     lat (usec): min=17, max=6702, avg=53.04, stdev=170.01
    clat percentiles (usec):
     |  1.00th=[   19],  5.00th=[   20], 10.00th=[   22], 20.00th=[   24],
     | 30.00th=[   26], 40.00th=[   28], 50.00th=[   30], 60.00th=[   32],
     | 70.00th=[   35], 80.00th=[   38], 90.00th=[   43], 95.00th=[   50],
     | 99.00th=[  750], 99.50th=[ 1303], 99.90th=[ 2278], 99.95th=[ 2835],
     | 99.99th=[ 4621]
   bw (  KiB/s): min=77216, max=371440, per=100.00%, avg=195742.40, stdev=123552.90, samples=5
   iops        : min=19304, max=92860, avg=48935.60, stdev=30888.22, samples=5
  lat (nsec)   : 500=6.48%, 750=0.13%, 1000=0.01%
  lat (usec)   : 2=0.46%, 4=2.96%, 10=5.27%, 20=6.28%, 50=45.63%
  lat (usec)   : 100=3.86%, 250=12.36%, 500=8.48%, 750=1.57%, 1000=1.24%
  lat (msec)   : 2=3.96%, 4=1.24%, 10=0.06%
  cpu          : usr=7.16%, sys=25.39%, ctx=105166, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=171MiB/s (180MB/s), 171MiB/s-171MiB/s (180MB/s-180MB/s), io=512MiB (537MB), run=2990-2990msec
  WRITE: bw=171MiB/s (180MB/s), 171MiB/s-171MiB/s (180MB/s-180MB/s), io=512MiB (537MB), run=2990-2990msec

Disk stats (read/write):
  nvme0n1: ios=78211/129441, sectors=625688/1037432, merge=0/41, ticks=38325/4981, in_queue=43325, util=75.38%